cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/SPI_STM32H7xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2023 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        27. February 2023
 * $Revision:    V1.6
 *
 * Driver:       Driver_SPI1/2/3/4/5/6
 *
 * Configured:   via CubeMX
 * Project:      SPI Driver for ST STM32H7xx
 * -------------------------------------------------------------------------- */

/*! \page stm32h7_spi SPI

# Revision History

- Version 1.6
  - Updated DMA and Data Cache handling (improved code readability and maintainability)
- Version 1.5
  - Corrected GetDataCount implementation in DMA mode
  - Corrected GetStatus function handling of Mode Fault
  - Improved robustness of Initialize, Uninitialize, PowerControl and Control functions
- Version 1.4
  - Corrected GetDataCount implementation
- Version 1.3
  - Updated Data Cache handling (checking of data alignment and size is configurable)
- Version 1.2
  - Corrected Data Cache handling
  - Removed __HAL_SPI_ENABLE from SPI_Control function
- Version 1.1.1
  - Corrected typo in preprocessor condition
- Version 1.1
  - Corrected Slave select handling
- Version 1.0
  - Initial release

# Capabilities

This driver supports **Master** and **Slave** modes.

# Instances

Hardware resource relating to driver instance is shown in the table below:

Driver Instance | Hardware Resource
:---------------|:-----------------:
Driver_SPI1     | SPI1
Driver_SPI2     | SPI2
Driver_SPI3     | SPI3
Driver_SPI4     | SPI4
Driver_SPI5     | SPI5
Driver_SPI6     | SPI6

# Limitations

Hardware limitations:
 - SPI6 with BDMA can access only SRAM4 memory.
   If BDMA is used on SPI6 ensure that Tx and Rx buffers are be positioned in SRAM4 memory.

DMA usage limitations:
 - The size of DCache line on Cortex M7 is 32 Bytes. To safely perform
   DCache maintenance operations, data must be aligned to a 32 Byte boundary
   and data size must be n*32 Bytes. By default, the alignment and size of
   provided data are checked in SPI transfer functions. If data is not
   aligned to a 32 Byte boundary or data size is not n*32 Bytes, DMA is
   not used and IRQ transfer is performed.
 - Advanced user can disable data alignment and/or data size checking by
   setting SPI_DCACHE_DATA_xX_ALIGNMENT and/or SPI_DCACHE_DATA_xX_SIZE to 0.
   The user must be aware that performing DCache maintenance operations on
   data that is not aligned to a 32 Byte boundary or that is not n*32 Bytes
   in size can be dangerous and can corrupt other data that is also maintained
   by the same 32 Byte DCache line.

# Configuration

## Compile-time

Definitions used for compile-time configuration of this driver are shown in the table below:

Definition                         | Default value | Value | Description
:----------------------------------|:-------------:|:-----:|:-----------
SPI_DCACHE_MAINTENANCE             |     **1**     |   1   | SPI DCache maintenance operations: **enabled**
^                                  |       ^       |   0   | SPI DCache maintenance operations: **disabled**
SPI_DCACHE_DATA_RX_ALIGNMENT       |     **1**     |   1   | SPI DCache data Rx alignment check: **enabled**
^                                  |       ^       |   0   | SPI DCache data Rx alignment check: **disabled**
SPI_DCACHE_DATA_RX_SIZE            |     **1**     |   1   | SPI DCache data Rx size check: **enabled**
^                                  |       ^       |   0   | SPI DCache data Rx size check: **disabled**
SPI_DCACHE_DATA_TX_ALIGNMENT       |     **1**     |   1   | SPI DCache data Tx alignment check: **enabled**
^                                  |       ^       |   0   | SPI DCache data Tx alignment check: **disabled**
SPI_DCACHE_DATA_TX_SIZE            |     **1**     |   1   | SPI DCache data Tx size check: **enabled**
^                                  |       ^       |   0   | SPI DCache data Tx size check: **disabled**

## STM32CubeMX

The SPI driver requires:
  - **SPI peripheral clock**
  - **SPI** peripheral configured as **Full-Duplex Master/Slave**
  - **SPI MISO, MOSI, SCK** and **NSS pins**
  - optional **DMA** configuration for transfers

# STM32H743I-EVAL Board Configuration

These settings are relevant for this board, for different board please refer to the board
schematic for proper configuration.

Link to [STM32H743I-EVAL board schematic](https://www.st.com/resource/en/schematic_pack/mb1246-h743-e03_schematic.pdf).

## STM32CubeMX

Required peripherals for the **STM32H743I-EVAL** board are listed in the table below:

Peripheral | Mode                         | Description
:---------:|:----------------------------:|:-----------
SPI5       | Full-Duplex Master           | SPI5 Controller
PF6        | Alternate Function Push Pull | SPI5 NSS Pin
PF7        | Alternate Function Push Pull | SPI5 SCK Pin
PF8        | Alternate Function Push Pull | SPI5 MISO Pin
PF9        | Alternate Function Push Pull | SPI5 MOSI Pin

\note All settings have to be configured as described in the procedure below. Important settings,
      typically the ones different from default, are emphasized in **bold**.

### Pinout & Configuration tab

  1. In the **Pinout view** window click on a pin and select it's functionality:
        Pin      | Functionality
        :--------|:-------------:
        PF6      | **SPI5_NSS**
        PF7      | **SPI5_SCK**
        PF8      | **SPI5_MISO**
        PF9      | **SPI5_MOSI**
       \n

  2. Under **Categories**: **Connectivity** select **SPI5**:

     __Mode__:
       - Mode: **Full-Duplex Master**
       - Hardware NSS Signal: **Hardware NSS Output Signal**

     __Configuration__:
       - Parameter Settings: not used
       - User Constants: not used
       - NVIC Settings: configured in later step (under Category: System Core: NVIC)
       - DMA Settings: configured in later step (under Category: System Core: DMA)
       - GPIO Settings:
            Pin Name | Signal on Pin | Pin Context..| GPIO output..| GPIO mode                     | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
            :--------|:-------------:|:------------:|:------------:|:-----------------------------:|:------------------:|:------------:|:---------:|:----------:
            PF6      | SPI5_NSS      | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
            PF7      | SPI5_SCK      | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
            PF8      | SPI5_MISO     | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
            PF9      | SPI5_MOSI     | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **Medium**   | n/a       | .
       \n

