cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/SPI_STM32H7xx.c
  3. Under **Categories**: **System Core** select **DMA**:

     __Configuration__:
       - DMA1, DMA2:
       \n
         Click **Add** button and add DMA Requests as in table below:
            DMA Request | Stream         | Direction            | Priority
            :----------:|:--------------:|:---------------------|:--------
            SPI5_RX     | DMA1 Stream 0  | Peripheral to Memory | Low
            SPI5_TX     | DMA1 Stream 1  | Memory to Peripheral | Low
       \n

  4. Under **Categories**: **System Core** select **NVIC**:

     __Configuration__:
       - NVIC:
            NVIC Interrupt Table              | Enabled     | Preemption Priority | Sub Priority
            :---------------------------------|:-----------:|:-------------------:|:------------:
            DMA1 stream0 global interrupt     | **checked** | 0                   | 0
            DMA1 stream1 global interrupt     | **checked** | 0                   | 0
            SPI5 global interrupt             | **checked** | 0                   | 0
       - Code generation:
            Enabled interrupt table           | Select for..| Generate Enable in..| Generate IRQ h.. | Call HAL handler
            :---------------------------------|:-----------:|:-------------------:|:----------------:|:----------------:
            DMA1 stream0 global interrupt     | unchecked   | checked             | checked          | checked
            DMA1 stream1 global interrupt     | unchecked   | checked             | checked          | checked
            SPI5 global interrupt             | unchecked   | checked             | checked          | checked

### Clock Configuration tab

  1. Configure **To SPI5 (MHz)**: **100**

### Project Manager tab

  1. Under **Advanced Settings**:

     __Generated Function Calls__:
        Generate Code | Function Name               | Peripheral Inst..| Do not generate ..| Visibility (Static)
        :-------------|:---------------------------:|:----------------:|:-----------------:|:-------------------:
        checked       | MX_SPI5_Init                | SPI1             | **checked**       | checked
     \n

\note If you use HAL based driver in parallel with the CMSIS Driver (for different instances) and if the
      <b>HAL_SPI_RegisterCallback</b> function is called then select <b>ENABLE</b> under <b>Register Callback</b>
      for the <b>SPI</b> peripheral.

### Generate Code

Generate source code by clicking on the **GENERATE CODE** button on the toolbar.

# Validation

Results of the **CMSIS-Driver Validation** for this driver can be found in the [SPI_TestReport.txt](../../../CMSIS/Driver/Validation/SPI_TestReport.txt) file.
*/

/*! \cond */

#include "SPI_STM32H7xx.h"
#include "DCache_STM32H7xx.h"

#define ARM_SPI_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,6)

#ifndef SPI_DCACHE_MAINTENANCE
#define SPI_DCACHE_MAINTENANCE                 (1U)
#endif
#ifndef SPI_DCACHE_DATA_RX_ALIGNMENT
#define SPI_DCACHE_DATA_RX_ALIGNMENT           (1U)
#endif
#ifndef SPI_DCACHE_DATA_RX_SIZE
#define SPI_DCACHE_DATA_RX_SIZE                (1U)
#endif
#ifndef SPI_DCACHE_DATA_TX_ALIGNMENT
#define SPI_DCACHE_DATA_TX_ALIGNMENT           (1U)
#endif
#ifndef SPI_DCACHE_DATA_TX_SIZE
#define SPI_DCACHE_DATA_TX_SIZE                (1U)
#endif

#define DRIVER_DCACHE_MAINTENANCE              (SPI_DCACHE_MAINTENANCE)
#if    (DRIVER_DCACHE_MAINTENANCE == 1U) && ((SPI_DCACHE_DATA_RX_ALIGNMENT == 0U) || (SPI_DCACHE_DATA_RX_SIZE == 0U))
#define DRIVER_DCACHE_RX_USER_GUARANTEED       (1U)
#else
#define DRIVER_DCACHE_RX_USER_GUARANTEED       (0U)
#endif
#if    (DRIVER_DCACHE_MAINTENANCE == 1U) && ((SPI_DCACHE_DATA_TX_ALIGNMENT == 0U) || (SPI_DCACHE_DATA_TX_SIZE == 0U))
#define DRIVER_DCACHE_TX_USER_GUARANTEED       (1U)
#else
#define DRIVER_DCACHE_TX_USER_GUARANTEED       (0U)
#endif

// Driver Version
static const ARM_DRIVER_VERSION DriverVersion = { ARM_SPI_API_VERSION, ARM_SPI_DRV_VERSION };

// Driver Capabilities
static const ARM_SPI_CAPABILITIES DriverCapabilities = {
  0,  /* Simplex Mode (Master and Slave) */
  1,  /* TI Synchronous Serial Interface */
  0,  /* Microwire Interface */
  1   /* Signal Mode Fault event: \ref ARM_SPI_EVENT_MODE_FAULT */
#if (defined(ARM_SPI_API_VERSION) && (ARM_SPI_API_VERSION >= 0x202U))
, 0U  /* Reserved bits */
#endif
};

static ARM_SPI_CAPABILITIES SPIX_GetCapabilities (void);
static int32_t              SPI_Initialize       (ARM_SPI_SignalEvent_t cb_event, const SPI_RESOURCES *spi);
static int32_t              SPI_Uninitialize     (const SPI_RESOURCES *spi);
static int32_t              SPI_PowerControl     (ARM_POWER_STATE state, const SPI_RESOURCES *spi);
static int32_t              SPI_Send             (const void *data, uint32_t num, const SPI_RESOURCES *spi);
static int32_t              SPI_Receive          (void *data, uint32_t num, const SPI_RESOURCES *spi);
static int32_t              SPI_Transfer         (const void *data_out, void *data_in, uint32_t num, const SPI_RESOURCES *spi);
static uint32_t             SPI_GetDataCount     (const SPI_RESOURCES *spi);
static int32_t              SPI_Control          (uint32_t control, uint32_t arg, const SPI_RESOURCES *spi);
static ARM_SPI_STATUS       SPI_GetStatus        (const SPI_RESOURCES *spi);

// SPI1
#ifdef MX_SPI1
#ifdef  MX_SPI1_NSS_Pin
  SPIx_PIN_NSS_STRUCT_ALLOC(1);
#endif
SPIx_RESOURCE_ALLOC(1);
#endif

// SPI2
#ifdef MX_SPI2
#ifdef  MX_SPI2_NSS_Pin
  SPIx_PIN_NSS_STRUCT_ALLOC(2);
#endif
SPIx_RESOURCE_ALLOC(2);
#endif

// SPI3
#ifdef MX_SPI3
#ifdef  MX_SPI3_NSS_Pin
  SPIx_PIN_NSS_STRUCT_ALLOC(3);
#endif
SPIx_RESOURCE_ALLOC(3);
#endif

// SPI4
#ifdef MX_SPI4
#ifdef  MX_SPI4_NSS_Pin
  SPIx_PIN_NSS_STRUCT_ALLOC(4);
#endif
SPIx_RESOURCE_ALLOC(4);
#endif

// SPI5
#ifdef MX_SPI5
#ifdef  MX_SPI5_NSS_Pin
  SPIx_PIN_NSS_STRUCT_ALLOC(5);
#endif
SPIx_RESOURCE_ALLOC(5);
#endif

// SPI6
#ifdef MX_SPI6
#ifdef  MX_SPI6_NSS_Pin
  SPIx_PIN_NSS_STRUCT_ALLOC(6);
#endif
SPIx_RESOURCE_ALLOC(6);
#endif

/**
  \fn          const SPI_RESOURCES SPI_Resources (SPI_HandleTypeDef *hspi)
  \brief       Get SPI_RESOURCES structure from SPI_HandleTypeDef
*/
static const SPI_RESOURCES * SPI_Resources (SPI_HandleTypeDef *hspi) {
  const SPI_RESOURCES *spi = NULL;

#ifdef MX_SPI1
  if (hspi->Instance == SPI1) { spi = &SPI1_Resources; }
#endif
#ifdef MX_SPI2
  if (hspi->Instance == SPI2) { spi = &SPI2_Resources; }
#endif
#ifdef MX_SPI3
  if (hspi->Instance == SPI3) { spi = &SPI3_Resources; }
#endif
#ifdef MX_SPI4
  if (hspi->Instance == SPI4) { spi = &SPI4_Resources; }
#endif
#ifdef MX_SPI5
  if (hspi->Instance == SPI5) { spi = &SPI5_Resources; }
#endif
#ifdef MX_SPI6
  if (hspi->Instance == SPI6) { spi = &SPI6_Resources; }
#endif

  return spi;
}

/**
  \fn          uint32_t SPI_GetClk (const SPI_RESOURCES *spi)
  \brief       Get SPI peripheral clock
*/
static uint32_t SPI_GetClk (const SPI_RESOURCES *spi) {
#if defined(MX_SPI4) || defined(MX_SPI5) || defined(MX_SPI6)
  uint32_t src;
  PLL2_ClocksTypeDef pll2_clocks;
  PLL3_ClocksTypeDef pll3_clocks;
#endif

#ifdef MX_SPI1
  if (spi->reg == SPI1) { return HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SPI1); }
#endif
#ifdef MX_SPI2
  if (spi->reg == SPI2) { return HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SPI2); }
#endif
#ifdef MX_SPI3
  if (spi->reg == SPI3) { return HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SPI3); }
#endif
#ifdef MX_SPI4
  if (spi->reg  == SPI4) {
    src = __HAL_RCC_GET_SPI4_SOURCE();
    switch (src) {
      case RCC_SPI4CLKSOURCE_D2PCLK1:
        return HAL_RCC_GetPCLK1Freq();

      case RCC_SPI4CLKSOURCE_PLL2:
        HAL_RCCEx_GetPLL2ClockFreq(&pll2_clocks);
        return (pll2_clocks.PLL2_Q_Frequency);

      case RCC_SPI4CLKSOURCE_PLL3:
        HAL_RCCEx_GetPLL3ClockFreq(&pll3_clocks);
        return (pll3_clocks.PLL3_Q_Frequency);

      case RCC_SPI4CLKSOURCE_HSI:
        if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIV) != 0U) {
          return (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER()>> 3));
        }
        else {
          return (HSI_VALUE);
        }

      case RCC_SPI4CLKSOURCE_CSI:
        return (CSI_VALUE);

      case RCC_SPI4CLKSOURCE_HSE:
        return (HSE_VALUE);
    }
  }
#endif
#ifdef MX_SPI5
  if (spi->reg  == SPI5) {
    src = __HAL_RCC_GET_SPI5_SOURCE();
    switch (src) {
      case RCC_SPI5CLKSOURCE_D2PCLK1:
        return HAL_RCC_GetPCLK1Freq();

      case RCC_SPI5CLKSOURCE_PLL2:
        HAL_RCCEx_GetPLL2ClockFreq(&pll2_clocks);
        return (pll2_clocks.PLL2_Q_Frequency);

      case RCC_SPI5CLKSOURCE_PLL3:
        HAL_RCCEx_GetPLL3ClockFreq(&pll3_clocks);
        return (pll3_clocks.PLL3_Q_Frequency);

      case RCC_SPI5CLKSOURCE_HSI:
        if (__HAL_RCC_GET_FLAG(RCC_FLAG_HSIDIV) != 0U) {
          return (HSI_VALUE >> (__HAL_RCC_GET_HSI_DIVIDER()>> 3));
        }
        else {
          return (HSI_VALUE);
        }

      case RCC_SPI5CLKSOURCE_CSI:
        return (CSI_VALUE);

      case RCC_SPI5CLKSOURCE_HSE:
        return (HSE_VALUE);
    }
  }
#endif
#ifdef MX_SPI6
  if (spi->reg  == SPI6) {
    src = __HAL_RCC_GET_SPI6_SOURCE();
    switch (src) {
      case RCC_SPI6CLKSOURCE_D3PCLK1:
        return HAL_RCCEx_GetD3PCLK1Freq();

      case RCC_SPI6CLKSOURCE_PLL2:
        HAL_RCCEx_GetPLL2ClockFreq(&pll2_clocks);
        return (pll2_clocks.PLL2_Q_Frequency);

